0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0); // Vitesse X = 20
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip; // L'air glisse sur les parois de la boîte
    }
    mirror
    {
	type		symmetryPlane;
    }
    "(plaque1)"
    {
        type            noSlip; // L'air ne glisse pas sur ton montage
    }
}

// ************************************************************************* //
