0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 400; // Valeur standard pour débuter
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip;
    }
    mirror
    {
        type            symmetryPlane;
    }
    "(plaque1)"
    {
        type            omegaWallFunction;
        value           uniform 400;
    }
}


// ************************************************************************* //
