system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
scale   1;

vertices
(
    (-6  0  -2.5)
    (10  0  -2.5)
    (10  3 -2.5)
    (-6  3 -2.5)
    (-6  0  3.5)
    (10  0  3.5)
    (10  3  3.5)
    (-6  3  3.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 6 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 3 7 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(1 2 6 5)
		);
	}
	walls
	{
		type patch;
		faces
		(
			(3 7 6 2)
			(0 1 2 3)
			(4 5 6 7)
		);
	}
	mirror
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
);


// ************************************************************************* //
