system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- To be more comparable to v2406 bug-fix branch disable the
//- near-wall distance fix (see v2412 release notes about 'Wall distance')
//OptimisationSwitches
//{
//    useCombinedWallPatch    0;
//}

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3500;

deltaT          1;

writeControl    timeStep;

writeInterval   150;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



functions
{
    #include "streamLines"
    #include "wallBoundedStreamLines"
    #include "cuttingPlane"
    #include "forceCoeffs"
    #include "ensightWrite"

    #include "solverInfo"
    #include "graphFunctionObject"
    #include "foamReport"
    /*
    forces
    {
	type	forceCoeffs;
	libs	(forces);
	writeControl	timeStep;
	timeInterval	1;

	patches	(cylindre plaque1 plaque2);
	rho	rhoInf;
	rhoInf	1.225;

	liftDir	(0 1 0);
	dragDir	(1 0 0);
	pitchAxis (0 0 1);
	magUInf	10;
	lRef	1.0;
	Aref	1.0;
	}*/
}


// ************************************************************************* //
